jobs-app/app/services/missions/generate_service.rb

SELECT "listings".* FROM "listings"
---
    def selected_listings
      return listings if !!listings

      Listing.all

INSERT INTO "missions" ("mission_type", "date", "price", "listing_id") VALUES (?, ?, ?, ?)  [["mission_type", "first_checkin"], ["date", "2016-10-10 00:00:00"], ["price", 20.0], ["listing_id", 1]]
INSERT INTO "missions" ("mission_type", "date", "price", "listing_id") VALUES (?, ?, ?, ?)  [["mission_type", "last_checkin"], ["date", "2016-10-15 00:00:00"], ["price", 10.0], ["listing_id", 1]]
---
    def compute_first_and_last_checkin_missions(listing)
      listing.bookings.active.each do |booking|
        listing.missions.create!(
          mission_type: Mission::MissionType::FIRST_CHECKIN,
          date: booking.start_date,
          price: 10*listing.num_rooms
        )

        listing.missions.create!(
          mission_type: Mission::MissionType::LAST_CHECKOUT,
          date: booking.end_date,
          price: 5*listing.num_rooms
        )

SELECT "reservations".* FROM "reservations" INNER JOIN "listings" ON "listings"."id" = "reservations"."listing_id" INNER JOIN "bookings" ON "bookings"."listing_id" = "listings"."id" WHERE (DATE(reservations.start_date) >= DATE(bookings.start_date) AND DATE(reservations.end_date) < DATE(bookings.end_date)) AND "listings"."id" = ?  [["id", 5]]
INSERT INTO "missions" ("mission_type", "date", "price", "listing_id") VALUES (?, ?, ?, ?)  [["mission_type", "checkout_checkin"], ["date", "2020-01-02 00:00:00"], ["price", 10.0], ["listing_id", 5]]
---
    def compute_checkout_checkin_missions(listing)
      Reservation.joins(listing: :bookings)
      .where('DATE(reservations.start_date) >= DATE(bookings.start_date) AND DATE(reservations.end_date) < DATE(bookings.end_date)')
      .where(listings: {id: listing.id})
      .each do |reservation|
        listing.missions.create!(
          mission_type: Mission::MissionType::CHECKOUT_CHECKIN,
          date: reservation.end_date,
          price: 10*listing.num_rooms
      )