jobs-app/lib/tasks/populate_db_from_file.rake

INSERT INTO "listings" ("id", "num_rooms") VALUES (?, ?)  [["id", 1], ["num_rooms", 2]]
INSERT INTO "bookings" ("id", "start_date", "end_date", "listing_id") VALUES (?, ?, ?, ?)  [["id", 1], ["start_date", "2016-10-10 00:00:00"], ["end_date", "2016-10-15 00:00:00"], ["listing_id", 1]]
INSERT INTO "reservations" ("id", "start_date", "end_date", "listing_id") VALUES (?, ?, ?, ?)  [["id", 1], ["start_date", "2016-10-11 00:00:00"], ["end_date", "2016-10-13 00:00:00"], ["listing_id", 1]]
---
  task :populate, [:file] => :environment do |task, args|
    json_data = JSON.parse(File.read(args.file))

    json_data['listings'].each do |listing_params|
      Listing.create!(listing_params)
    end

    json_data['bookings'].each do |booking_params|
      Booking.create!(booking_params)
    end

    json_data['reservations'].each do |reservation_params|
      Reservation.create!(reservation_params)