jobs-app/app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("start_date", "end_date", "listing_id") VALUES (?, ?, ?)  [["start_date", "2019-11-07 00:00:00"], ["end_date", "2019-11-13 00:00:00"], ["listing_id", 1]]
---
  def create
    @booking = Booking.new(booking_params)

    respond_to do |format|
      if @booking.save

UPDATE "bookings" SET "end_date" = ? WHERE "bookings"."id" = ?  [["end_date", "2020-01-05 00:00:00"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @booking.update(booking_params)