jobs-app/app/controllers/listings_controller.rb

  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-11-01 13:18:31.078673"], ["updated_at", "2019-11-01 13:18:31.078673"]]