jobs-app/app/controllers/missions_controller.rb

  def index
    @missions = Mission.all
---
SELECT "missions".* FROM "missions"