jobs-app/app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("start_date", "end_date", "listing_id") VALUES (?, ?, ?)  [["start_date", "2019-11-15 00:00:00"], ["end_date", "2019-11-20 00:00:00"], ["listing_id", 1]]

  def update
    respond_to do |format|
      if @reservation.update(reservation_params)
---
UPDATE "reservations" SET "end_date" = ? WHERE "reservations"."id" = ?  [["end_date", "2020-01-02 00:00:00"], ["id", 5]]